<?php
require_once "functions.php";

/*====================== ЗАДАНИЕ #1 ==========================*/
echo "****************** ЗАДАНИЕ #1 *******************" . PHP_EOL . "<br>";
echo task1(formArrStrForTask1()) . PHP_EOL . "<br>";
echo task1(formArrStrForTask1(), true) . PHP_EOL . PHP_EOL . "<br><br>" ;
/*=================== КОНЕЦ ЗАДАНИЯ #1 =======================*/

/*====================== ЗАДАНИЕ #2 ==========================*/
echo "****************** ЗАДАНИЕ #2 *******************" . PHP_EOL . "<br>";
$arr = [10, 5, 2];
echo task2($arr, 'sum')  . PHP_EOL . "<br>";
echo task2($arr, 'sub')  . PHP_EOL . "<br>";
echo task2($arr, 'mul')  . PHP_EOL . "<br>";
echo task2($arr, 'div')  . PHP_EOL . "<br>";
array_push($arr, 0);
echo task2($arr, 'div')  . PHP_EOL . "<br>";
array_push($arr, '1.4');
echo task2($arr, 'sum')  . PHP_EOL . "<br>";
array_push($arr, 'не число');
echo task2($arr, 'sum')  . PHP_EOL . "<br>";
echo task2($arr, null)  . PHP_EOL . "<br>";
unset($arr);
echo task2($arr, 'sum')  . PHP_EOL . PHP_EOL . "<br><br>";
/*=================== КОНЕЦ ЗАДАНИЯ #2 =======================*/

/*====================== ЗАДАНИЕ #3 ==========================*/
echo "****************** ЗАДАНИЕ #3 *******************" . PHP_EOL . "<br>";
echo task3('+', 10, 5, 2.3) . PHP_EOL . PHP_EOL . "<br><br>";
/*=================== КОНЕЦ ЗАДАНИЯ #3 =======================*/

/*====================== ЗАДАНИЕ #4 ==========================*/
echo "****************** ЗАДАНИЕ #4 *******************" . PHP_EOL . "<br>";
echo task4(2, 2.1)  . PHP_EOL . "<br>";
echo task4(2, 'asdsa')  . PHP_EOL . "<br>";
echo task4(3, 3) . PHP_EOL . PHP_EOL . "<br><br>";
/*=================== КОНЕЦ ЗАДАНИЯ #4 =======================*/

/*====================== ЗАДАНИЕ #5 ==========================*/
echo "****************** ЗАДАНИЕ #5 *******************" . PHP_EOL . "<br>";
$str = 'А роза упала на лапу Азора1';
$b = task5_1($str);
$task5 = function () use ($str, $b) {
    if ($b) {
        echo "Строка \"$str\" является палиндромом" . PHP_EOL . PHP_EOL . "<br><br>";
    } else {
        echo "Строка \"$str\" НЕ является палиндромом" . PHP_EOL . PHP_EOL . "<br><br>";
    }
};
$task5();
/*=================== КОНЕЦ ЗАДАНИЯ #5 =======================*/

/*====================== ЗАДАНИЕ #6 ==========================*/
echo "****************** ЗАДАНИЕ #6 *******************" . PHP_EOL . "<br>";
echo task6() . PHP_EOL . PHP_EOL . "<br><br>";
/*=================== КОНЕЦ ЗАДАНИЯ #6 =======================*/

/*====================== ЗАДАНИЕ #7 ==========================*/
echo "****************** ЗАДАНИЕ #7 *******************" . PHP_EOL . "<br>";
echo task7() . PHP_EOL . PHP_EOL . "<br><br>";
/*=================== КОНЕЦ ЗАДАНИЯ #7 =======================*/

/*====================== ЗАДАНИЕ #8 ==========================*/
echo "****************** ЗАДАНИЕ #8 *******************" . PHP_EOL . "<br>";
echo task8(task8_1()) . PHP_EOL . PHP_EOL . "<br><br>";
/*=================== КОНЕЦ ЗАДАНИЯ #8 =======================*/

/*====================== ЗАДАНИЕ #9 ==========================*/
echo "****************** ЗАДАНИЕ #9 *******************" . PHP_EOL . "<br>";
task9('test.tst'); echo PHP_EOL . "<br>";
task9('test.txt');
echo PHP_EOL . PHP_EOL . "<br><br>";
/*=================== КОНЕЦ ЗАДАНИЯ #9 =======================*/

/*====================== ЗАДАНИЕ #10 ==========================*/
echo "****************** ЗАДАНИЕ #10 *******************" . PHP_EOL . "<br>";
task10();
echo PHP_EOL . PHP_EOL . "<br><br>";
/*=================== КОНЕЦ ЗАДАНИЯ #10 =======================*/


